zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/sdramc.h
/* -------- SDRAMC_IMR : (SDRAMC Offset: 0x1c) (R/ 32) SDRAMC Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t RES:1;                     /**< bit:      0  Refresh Error Interrupt Mask                  */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __SDRAMC_IMR_bits_t;

#define SDRAMC_IMR_RES_Pos                    (0)                                            /**< (SDRAMC_IMR) Refresh Error Interrupt Mask Position */
#define SDRAMC_IMR_RES_Msk                    (0x1U << SDRAMC_IMR_RES_Pos)                   /**< (SDRAMC_IMR) Refresh Error Interrupt Mask Mask */
#define SDRAMC_IMR_Msk                        (0x00000001UL)                                 /**< (SDRAMC_IMR) Register Mask  */

/* -------- SDRAMC_ISR : (SDRAMC Offset: 0x20) (R/ 32) SDRAMC Interrupt Status Register -------- */

typedef union
{
  struct
  {
    uint32_t RES:1;                     /**< bit:      0  Refresh Error Status (cleared on read)        */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __SDRAMC_ISR_bits_t;

#define SDRAMC_ISR_RES_Pos                    (0)                                            /**< (SDRAMC_ISR) Refresh Error Status (cleared on read) Position */
#define SDRAMC_ISR_RES_Msk                    (0x1U << SDRAMC_ISR_RES_Pos)                   /**< (SDRAMC_ISR) Refresh Error Status (cleared on read) Mask */
#define SDRAMC_ISR_Msk                        (0x00000001UL)                                 /**< (SDRAMC_ISR) Register Mask  */

/* -------- SDRAMC_MDR : (SDRAMC Offset: 0x24) (R/W 32) SDRAMC Memory Device Register -------- */

typedef union
{
  struct
  {
    uint32_t MD:2;                      /**< bit:   0..1  Memory Device Type                            */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __SDRAMC_MDR_bits_t;

#define SDRAMC_MDR_MD_Pos                     (0)                                            /**< (SDRAMC_MDR) Memory Device Type Position */
#define SDRAMC_MDR_MD_Msk                     (0x3U << SDRAMC_MDR_MD_Pos)                    /**< (SDRAMC_MDR) Memory Device Type Mask */
#define SDRAMC_MDR_MD(value)                  (SDRAMC_MDR_MD_Msk & ((value) << SDRAMC_MDR_MD_Pos))
#define   SDRAMC_MDR_MD_SDRAM_Val             (0x0U)                                         /**< (SDRAMC_MDR) SDRAM  */
#define   SDRAMC_MDR_MD_LPSDRAM_Val           (0x1U)                                         /**< (SDRAMC_MDR) Low-power SDRAM  */
#define SDRAMC_MDR_MD_SDRAM                   (SDRAMC_MDR_MD_SDRAM_Val << SDRAMC_MDR_MD_Pos)  /**< (SDRAMC_MDR) SDRAM Position  */
#define SDRAMC_MDR_MD_LPSDRAM                 (SDRAMC_MDR_MD_LPSDRAM_Val << SDRAMC_MDR_MD_Pos)  /**< (SDRAMC_MDR) Low-power SDRAM Position  */
#define SDRAMC_MDR_Msk                        (0x00000003UL)                                 /**< (SDRAMC_MDR) Register Mask  */

/* -------- SDRAMC_CFR1 : (SDRAMC Offset: 0x28) (R/W 32) SDRAMC Configuration Register 1 -------- */

typedef union
{
  struct
  {
    uint32_t TMRD:4;                    /**< bit:   0..3  Load Mode Register Command to Active or Refresh Command */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t UNAL:1;                    /**< bit:      8  Support Unaligned Access                      */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __SDRAMC_CFR1_bits_t;

#define SDRAMC_CFR1_TMRD_Pos                  (0)                                            /**< (SDRAMC_CFR1) Load Mode Register Command to Active or Refresh Command Position */
#define SDRAMC_CFR1_TMRD_Msk                  (0xFU << SDRAMC_CFR1_TMRD_Pos)                 /**< (SDRAMC_CFR1) Load Mode Register Command to Active or Refresh Command Mask */
#define SDRAMC_CFR1_TMRD(value)               (SDRAMC_CFR1_TMRD_Msk & ((value) << SDRAMC_CFR1_TMRD_Pos))
#define SDRAMC_CFR1_UNAL_Pos                  (8)                                            /**< (SDRAMC_CFR1) Support Unaligned Access Position */
#define SDRAMC_CFR1_UNAL_Msk                  (0x1U << SDRAMC_CFR1_UNAL_Pos)                 /**< (SDRAMC_CFR1) Support Unaligned Access Mask */
#define   SDRAMC_CFR1_UNAL_UNSUPPORTED_Val    (0x0U)                                         /**< (SDRAMC_CFR1) Unaligned access is not supported.  */
#define   SDRAMC_CFR1_UNAL_SUPPORTED_Val      (0x1U)                                         /**< (SDRAMC_CFR1) Unaligned access is supported.  */
#define SDRAMC_CFR1_UNAL_UNSUPPORTED          (SDRAMC_CFR1_UNAL_UNSUPPORTED_Val << SDRAMC_CFR1_UNAL_Pos)  /**< (SDRAMC_CFR1) Unaligned access is not supported. Position  */
#define SDRAMC_CFR1_UNAL_SUPPORTED            (SDRAMC_CFR1_UNAL_SUPPORTED_Val << SDRAMC_CFR1_UNAL_Pos)  /**< (SDRAMC_CFR1) Unaligned access is supported. Position  */
#define SDRAMC_CFR1_Msk                       (0x0000010FUL)                                 /**< (SDRAMC_CFR1) Register Mask  */

/* -------- SDRAMC_OCMS : (SDRAMC Offset: 0x2c) (R/W 32) SDRAMC OCMS Register -------- */

typedef union
{
  struct
  {
    uint32_t SDR_SE:1;                  /**< bit:      0  SDRAM Memory Controller Scrambling Enable     */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __SDRAMC_OCMS_bits_t;

#define SDRAMC_OCMS_SDR_SE_Pos                (0)                                            /**< (SDRAMC_OCMS) SDRAM Memory Controller Scrambling Enable Position */
#define SDRAMC_OCMS_SDR_SE_Msk                (0x1U << SDRAMC_OCMS_SDR_SE_Pos)               /**< (SDRAMC_OCMS) SDRAM Memory Controller Scrambling Enable Mask */
#define SDRAMC_OCMS_Msk                       (0x00000001UL)                                 /**< (SDRAMC_OCMS) Register Mask  */

/* -------- SDRAMC_OCMS_KEY1 : (SDRAMC Offset: 0x30) (/W 32) SDRAMC OCMS KEY1 Register -------- */

typedef union
{
  struct
  {
    uint32_t KEY1:32;                   /**< bit:  0..31  Off-chip Memory Scrambling (OCMS) Key Part 1  */
  };
  uint32_t w;
} __SDRAMC_OCMS_KEY1_bits_t;

