zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/sdramc.h
#define SDRAMC_OCMS_KEY1_KEY1_Pos             (0)                                            /**< (SDRAMC_OCMS_KEY1) Off-chip Memory Scrambling (OCMS) Key Part 1 Position */
#define SDRAMC_OCMS_KEY1_KEY1_Msk             (0xFFFFFFFFU << SDRAMC_OCMS_KEY1_KEY1_Pos)     /**< (SDRAMC_OCMS_KEY1) Off-chip Memory Scrambling (OCMS) Key Part 1 Mask */
#define SDRAMC_OCMS_KEY1_KEY1(value)          (SDRAMC_OCMS_KEY1_KEY1_Msk & ((value) << SDRAMC_OCMS_KEY1_KEY1_Pos))
#define SDRAMC_OCMS_KEY1_Msk                  (0xFFFFFFFFUL)                                 /**< (SDRAMC_OCMS_KEY1) Register Mask  */

/* -------- SDRAMC_OCMS_KEY2 : (SDRAMC Offset: 0x34) (/W 32) SDRAMC OCMS KEY2 Register -------- */

typedef union
{
  struct
  {
    uint32_t KEY2:32;                   /**< bit:  0..31  Off-chip Memory Scrambling (OCMS) Key Part 2  */
  };
  uint32_t w;
} __SDRAMC_OCMS_KEY2_bits_t;

#define SDRAMC_OCMS_KEY2_KEY2_Pos             (0)                                            /**< (SDRAMC_OCMS_KEY2) Off-chip Memory Scrambling (OCMS) Key Part 2 Position */
#define SDRAMC_OCMS_KEY2_KEY2_Msk             (0xFFFFFFFFU << SDRAMC_OCMS_KEY2_KEY2_Pos)     /**< (SDRAMC_OCMS_KEY2) Off-chip Memory Scrambling (OCMS) Key Part 2 Mask */
#define SDRAMC_OCMS_KEY2_KEY2(value)          (SDRAMC_OCMS_KEY2_KEY2_Msk & ((value) << SDRAMC_OCMS_KEY2_KEY2_Pos))
#define SDRAMC_OCMS_KEY2_Msk                  (0xFFFFFFFFUL)                                 /**< (SDRAMC_OCMS_KEY2) Register Mask  */

/** \brief SDRAMC register offsets definitions */
#define SDRAMC_MR_OFFSET             (0x00)         /**< (SDRAMC_MR) SDRAMC Mode Register Offset */
#define SDRAMC_TR_OFFSET             (0x04)         /**< (SDRAMC_TR) SDRAMC Refresh Timer Register Offset */
#define SDRAMC_CR_OFFSET             (0x08)         /**< (SDRAMC_CR) SDRAMC Configuration Register Offset */
#define SDRAMC_LPR_OFFSET            (0x10)         /**< (SDRAMC_LPR) SDRAMC Low Power Register Offset */
#define SDRAMC_IER_OFFSET            (0x14)         /**< (SDRAMC_IER) SDRAMC Interrupt Enable Register Offset */
#define SDRAMC_IDR_OFFSET            (0x18)         /**< (SDRAMC_IDR) SDRAMC Interrupt Disable Register Offset */
#define SDRAMC_IMR_OFFSET            (0x1C)         /**< (SDRAMC_IMR) SDRAMC Interrupt Mask Register Offset */
#define SDRAMC_ISR_OFFSET            (0x20)         /**< (SDRAMC_ISR) SDRAMC Interrupt Status Register Offset */
#define SDRAMC_MDR_OFFSET            (0x24)         /**< (SDRAMC_MDR) SDRAMC Memory Device Register Offset */
#define SDRAMC_CFR1_OFFSET           (0x28)         /**< (SDRAMC_CFR1) SDRAMC Configuration Register 1 Offset */
#define SDRAMC_OCMS_OFFSET           (0x2C)         /**< (SDRAMC_OCMS) SDRAMC OCMS Register Offset */
#define SDRAMC_OCMS_KEY1_OFFSET      (0x30)         /**< (SDRAMC_OCMS_KEY1) SDRAMC OCMS KEY1 Register Offset */
#define SDRAMC_OCMS_KEY2_OFFSET      (0x34)         /**< (SDRAMC_OCMS_KEY2) SDRAMC OCMS KEY2 Register Offset */

/** \brief SDRAMC register API structure */
typedef struct
{
  __IO  __SDRAMC_MR_bits_t             SDRAMC_MR;     /**< Offset: 0x00 (R/W  32) SDRAMC Mode Register */
  __IO  __SDRAMC_TR_bits_t             SDRAMC_TR;     /**< Offset: 0x04 (R/W  32) SDRAMC Refresh Timer Register */
  __IO  __SDRAMC_CR_bits_t             SDRAMC_CR;     /**< Offset: 0x08 (R/W  32) SDRAMC Configuration Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  __SDRAMC_LPR_bits_t            SDRAMC_LPR;    /**< Offset: 0x10 (R/W  32) SDRAMC Low Power Register */
  __O   __SDRAMC_IER_bits_t            SDRAMC_IER;    /**< Offset: 0x14 ( /W  32) SDRAMC Interrupt Enable Register */
  __O   __SDRAMC_IDR_bits_t            SDRAMC_IDR;    /**< Offset: 0x18 ( /W  32) SDRAMC Interrupt Disable Register */
  __I   __SDRAMC_IMR_bits_t            SDRAMC_IMR;    /**< Offset: 0x1C (R/   32) SDRAMC Interrupt Mask Register */
  __I   __SDRAMC_ISR_bits_t            SDRAMC_ISR;    /**< Offset: 0x20 (R/   32) SDRAMC Interrupt Status Register */
  __IO  __SDRAMC_MDR_bits_t            SDRAMC_MDR;    /**< Offset: 0x24 (R/W  32) SDRAMC Memory Device Register */
  __IO  __SDRAMC_CFR1_bits_t           SDRAMC_CFR1;   /**< Offset: 0x28 (R/W  32) SDRAMC Configuration Register 1 */
  __IO  __SDRAMC_OCMS_bits_t           SDRAMC_OCMS;   /**< Offset: 0x2C (R/W  32) SDRAMC OCMS Register */
  __O   __SDRAMC_OCMS_KEY1_bits_t      SDRAMC_OCMS_KEY1; /**< Offset: 0x30 ( /W  32) SDRAMC OCMS KEY1 Register */
  __O   __SDRAMC_OCMS_KEY2_bits_t      SDRAMC_OCMS_KEY2; /**< Offset: 0x34 ( /W  32) SDRAMC OCMS KEY2 Register */
} sdramc_registers_t;
/** @}  end of SDRAM Controller */

#endif /* _PIC32CZ_CA70_SDRAMC_COMPONENT_H_ */
